## Check if a date in one df is between two dates in another df

In [40]:
import pandas as pd

In [49]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [57]:
#use this to create a datetime df
date_list = pd.date_range(start = '2019-05-01 00:00:00.00', end = '2019-08-01 02:15:00.00', freq = '1W' )
datelist_df = pd.DataFrame(date_list)
datelist_df.columns = ['date_time']
datelist_df

In [50]:
data1 = { 
    'date': ['2019-05-01 00:00:00', '2019-05-01 00:05:00', '2019-05-01 00:10:00']
        }

data2 = {
    'start': ['2019-05-01 00:02:50', '2019-05-01 00:04:30', '2019-05-01 00:11:00'] ,
     'end':['2019-05-01 00:05:00', '2019-05-01 00:11:00', '2019-05-01 00:12:00']
        }

df1 = pd.DataFrame(data=data1)
df2 = pd.DataFrame(data=data2)

In [51]:
pd.to_datetime(df1['date'])
pd.to_datetime(df2['start'])
pd.to_datetime(df2['end'])

0   2019-05-01 00:00:00
1   2019-05-01 00:05:00
2   2019-05-01 00:10:00
Name: date, dtype: datetime64[ns]

0   2019-05-01 00:02:50
1   2019-05-01 00:04:30
2   2019-05-01 00:11:00
Name: start, dtype: datetime64[ns]

0   2019-05-01 00:05:00
1   2019-05-01 00:11:00
2   2019-05-01 00:12:00
Name: end, dtype: datetime64[ns]

In [52]:
df1

                  date
0  2019-05-01 00:00:00
1  2019-05-01 00:05:00
2  2019-05-01 00:10:00

In [53]:
df2

                 start                  end
0  2019-05-01 00:02:50  2019-05-01 00:05:00
1  2019-05-01 00:04:30  2019-05-01 00:11:00
2  2019-05-01 00:11:00  2019-05-01 00:12:00

In [56]:
df1['matches'] = 0
for index1, row1 in df1.iterrows():
    x = row1.date
    for index2, row2 in df2.iterrows():
        if (x >= row2.start) & (x <= row2.end):
            df1.loc[index1, 'matches'] += 1 
            print(df1)

                  date  matches
0  2019-05-01 00:00:00        0
1  2019-05-01 00:05:00        1
2  2019-05-01 00:10:00        0
                  date  matches
0  2019-05-01 00:00:00        0
1  2019-05-01 00:05:00        2
2  2019-05-01 00:10:00        0
                  date  matches
0  2019-05-01 00:00:00        0
1  2019-05-01 00:05:00        2
2  2019-05-01 00:10:00        1

In [48]:
df1

                 date  matches
0 2019-05-01 00:00:00        0
1 2019-05-01 00:05:00        2
2 2019-05-01 00:10:00        1

#### we can then groupby to aggregate the data to see how many per a certain time period

In [46]:
df1['date'] = pd.to_datetime(df1['date'])

In [47]:
df1_filter = df1.groupby(pd.Grouper(key='date', axis=0, freq='D'))['matches'].sum()
df1_filter

date
2019-05-01    3
Freq: D, Name: matches, dtype: int64